test/rails/blog/app/controllers/comments_controller.rb

  def index
    @post = Post.find(params[:post_id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)

  def show
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "comments" WHERE ("comments"."id" = 1 AND ("comments".post_id = 1))

  def new
    @post = Post.find(params[:post_id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    if @comment.save
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("updated_at", "body", "post_id", "commenter", "created_at") VALUES('2009-11-16 01:38:58', 'holy diver rocks.', 1, 'ronnie james dio', '2009-11-16 01:38:58')