test/rails/mydiary/app/controllers/entries_controller.rb

  def view_all
    @entries = Entry.all(:order => 'created_at DESC')
---
SELECT * FROM "entries" ORDER BY created_at DESC

  def index
    @entries = Entry.all
---
SELECT * FROM "entries"

  def show
    @entry = Entry.find(params[:id])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 1)

  def edit
    @entry = Entry.find(params[:id])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 1)

  def create
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("updated_at", "title", "content", "created_at") VALUES('2009-11-12 05:37:41', 'diary entry 1', 'dear diary, ruby on rails is pretty cool.', '2009-11-12 05:37:41')

  def update
    @entry = Entry.find(params[:id])

    respond_to do |format|
      if @entry.update_attributes(params[:entry])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 2)
UPDATE "entries" SET "content" = 'let''s see if this triggers updated_at field.', "updated_at" = '2009-11-12 05:39:49' WHERE "id" = 2