test/rails/photo_album/app/controllers/albums_controller.rb

  def index
    @albums = Album.all
---
SELECT * FROM "albums"

  def show
    @album = Album.find(params[:id])
---
SELECT * FROM "albums" WHERE ("albums"."id" = 1)

  def edit
    @album = Album.find(params[:id])
---
SELECT * FROM "albums" WHERE ("albums"."id" = 1)