test/rails/photo_album/app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
---
SELECT * FROM "photos"

  def show
    @photo = Photo.find(params[:id])
---
SELECT * FROM "photos" WHERE ("photos".album_id = 1)

  def edit
    @photo = Photo.find(params[:id])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 2)